In [1]:
import mysql.connector

mydb = mysql.connector.connect(
    host="localhost",
    user="root",
    password="9393",
    database="PYTHON",
)#create database databasename

mypython = mydb.cursor()
print("connection established")

connection established

In [2]:
sql_query = "Insert into employee(Name,Address) VALUES(%s,%s)"

In [3]:
mul_values =[
    ('Peter', 'Lowstreet 4'),
  ('Amy', 'Apple st 652'),
  ('Hannah', 'Mountain 21'),
  ('Michael', 'Valley 345'),
  ('Sandy', 'Ocean blvd 2'),
  ('Betty', 'Green Grass 1'),
  ('Richard', 'Sky st 331'),
  ('Susan', 'One way 98'),
  ('Vicky', 'Yellow Garden 2'),
  ('Ben', 'Park Lane 38'),
  ('William', 'Central st 954'),
  ('Chuck', 'Main Road 989'),
  ('Viola', 'Sideway 1633'),
    ('Peterss', 'Lowstreet 4'),
    ('Peters', 'Lowstreet 4'),
]

In [4]:
mypython.executemany(sql_query,mul_values)

In [5]:
mypython.execute("select * from employee")

In [6]:
myresult1 = mypython.fetchone()
print(myresult1)

('Peter', 'Lowstreet 4')

In [7]:
myresultall = mypython.fetchmany()
print(myresultall)

[('Amy', 'Apple st 652')]

In [8]:
myresult_FETCHALL = mypython.fetchall()

In [9]:
for i in myresult_FETCHALL:
    print(i)

('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Peterss', 'Lowstreet 4')
('Peters', 'Lowstreet 4')

In [10]:
fetchwar = mypython.fetchwarnings()
print(fetchwar)

None

In [11]:
sql = "SELECT * FROM EMPLOYEE WHERE ADDRESS = 'Lowstreet 4'"

mypython.execute(sql)
myresult = mypython.fetchall()

for x in myresult:
    print(x)

('Peter', 'Lowstreet 4')
('Peterss', 'Lowstreet 4')
('Peters', 'Lowstreet 4')

In [12]:
sql = "SELECT Name FROM EMPLOYEE WHERE ADDRESS = 'Lowstreet 4'"

mypython.execute(sql)
myresult = mypython.fetchall()

for x in myresult:
    print(x)

('Peter',)
('Peterss',)
('Peters',)

In [13]:
sql1 = "SELECT ADDRESS FROM EMPLOYEE ORDER BY NAME"
mypython.execute(sql1)

myresult = mypython.fetchall()

for x in myresult:
    print(x)

('Apple st 652',)
('Park Lane 38',)
('Green Grass 1',)
('Main Road 989',)
('Mountain 21',)
('Valley 345',)
('Lowstreet 4',)
('Lowstreet 4',)
('Lowstreet 4',)
('Sky st 331',)
('Ocean blvd 2',)
('One way 98',)
('Yellow Garden 2',)
('Sideway 1633',)
('Central st 954',)

In [14]:
sql2 = "DELETE FROM employee WHERE Address = 'Lowstreet 4'"

In [15]:
mypython.execute(sql2)

In [16]:
print(mypython.rowcount)

3

In [26]:
mypython.execute("CREATE TABLE DUMMY11(Name Varchar(20))")

print("table created")

table created

In [27]:
sql_drop = "DROP TABLE DUMMY11"

mypython.execute(sql_drop)
print("table droped")

table droped

In [30]:
sql_update = "UPDATE Employee SET address = 'Green Grass 1' where address = 'Yellow Garden 2'"
mypython.execute(sql_update)

mydb.commit()


print(mypython.rowcount,"record(s) affected")

1 record(s) affected

In [31]:
sql_limit = "SELECT * FROM EMPLOYEE LIMIT 5"

mypython.execute(sql_limit)

myresult_limit = mypython.fetchall()

for x in myresult_limit:
    print(x)

('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')